In [35]:
# import necessary library
import pandas as pd
import sqlalchemy
from sqlalchemy import create_engine

In [37]:
# reading the database:
df=pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data",sep=",",header=None)
# Rename the column names
df.columns=["Age","WorkClass","BatchId","Education","Number","MartialStatus","Occupation",
               "Relationship","Race","Sex","CapitalGain",'CapitalLoss',"Hours","Country","Income"]
## creating engine
engine=create_engine("sqlite:///sqlassignment2.db")
## convet to sql
df.to_sql("Table_one",engine)

In [7]:
df.head(3)

,Age,WorkClass,BatchId,Education,Number,MartialStatus,Occupation,Relationship,Race,Sex,CapitalGain,CapitalLoss,Hours,Country,Income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K

In [9]:
#Que(1) Create an sqlalchemy engine using a sample from the data set??

In [8]:
result=engine.execute("Select * from Table_one limit 5;")
for row in result:
    print("Results:",row)

Results: (0, 39, ' State-gov', 77516, ' Bachelors', 13, ' Never-married', ' Adm-clerical', ' Not-in-family', ' White', ' Male', 2174, 0, 40, ' United-States', ' <=50K')
Results: (1, 50, ' Self-emp-not-inc', 83311, ' Bachelors', 13, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', 0, 0, 13, ' United-States', ' <=50K')
Results: (2, 38, ' Private', 215646, ' HS-grad', 9, ' Divorced', ' Handlers-cleaners', ' Not-in-family', ' White', ' Male', 0, 0, 40, ' United-States', ' <=50K')
Results: (3, 53, ' Private', 234721, ' 11th', 7, ' Married-civ-spouse', ' Handlers-cleaners', ' Husband', ' Black', ' Male', 0, 0, 40, ' United-States', ' <=50K')
Results: (4, 28, ' Private', 338409, ' Bachelors', 13, ' Married-civ-spouse', ' Prof-specialty', ' Wife', ' Black', ' Female', 0, 0, 40, ' Cuba', ' <=50K')

In [10]:
# Que(2): Write two basic update queries??

In [11]:
# First see the existing data:
print("Data before updating for gender")
result=engine.execute ( " Select * from Table_one where BatchId=77516 ; ")
for row in result:
    print("Results: ",row)

Data before updating for gender
Results:  (0, 39, ' State-gov', 77516, ' Bachelors', 13, ' Never-married', ' Adm-clerical', ' Not-in-family', ' White', ' Male', 2174, 0, 40, ' United-States', ' <=50K')

In [17]:
## Then let see the two data update queries:

print(" After updating data for gender Male and Female and Number 13 to 20")
engine.execute(" Update Table_one Set Sex='Female' where BatchId=77516;   ")

# Second update Query:

engine.execute("Update Table_one SET Number=20 where BatchId=77516")

result=engine.execute ( "Select * from Table_one where BatchId=77516")
for row in result:
    print("Results: ",row)

 After updating data for gender Male and Female and Number 13 to 20
Results:  (0, 39, ' State-gov', 77516, ' Bachelors', 20, ' Never-married', ' Adm-clerical', ' Not-in-family', ' White', 'Female', 2174, 0, 40, ' United-States', ' <=50K')

In [18]:
# Que(3): Write two delete queries??

In [19]:
print("Before Deleting any Data: ")
result=engine.execute("Select * from Table_one where BatchId in(77516,215646)")
for row in result:
    print("Results:",row)

Before Deleting any Data:
Results: (0, 39, ' State-gov', 77516, ' Bachelors', 20, ' Never-married', ' Adm-clerical', ' Not-in-family', ' White', 'Female', 2174, 0, 40, ' United-States', ' <=50K')
Results: (2, 38, ' Private', 215646, ' HS-grad', 9, ' Divorced', ' Handlers-cleaners', ' Not-in-family', ' White', ' Male', 0, 0, 40, ' United-States', ' <=50K')

In [21]:
# Deleting the queries:
print("After deleting the data")
engine.execute("delete from Table_one where BatchId in(77516);")

# second query deleting:
engine.execute("delete from Table_one where Age=38 and Education=' HS-grad' and sex=' Male' and Race=' White' and Relationship=' Not-in-family' and Occupation=' Handlers-cleaners';   ")

result=engine.execute(" select * from Table_one where BatchId in(77516,215646)")

for row in result:
    print("Results: ",row)

After deleting the data

In [22]:
# Que(4):Write two filter queries??

In [27]:
## Now let do from easy way , we were writing this:
#for row in result:
 ##   print("Results : ",row)
  # now doing same with defining the function as:
def results(q):
    result=engine.execute(q)
    for row in result:
        print("Results: ",row)

In [45]:
# First filter condition:
results("Select * from Table_one where BatchId in(99928,124191) and Sex=' Male'; ")

Results:  (100, 76, ' Private', 124191, ' Masters', 14, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', 0, 0, 40, ' United-States', ' >50K')

In [48]:
# Second filter Conditions:
results("select * from Table_one where Sex=' Female' and BatchId like '%89392%'; ")

Results:  (1341, 57, ' Private', 89392, ' Masters', 14, ' Married-spouse-absent', ' Prof-specialty', ' Not-in-family', ' White', ' Female', 0, 0, 40, ' United-States', ' <=50K')

In [49]:
## OR this way: 
#First and second filter condition:
result=engine.execute("Select * from Table_one where BatchId in(99928,124191) and Sex=' Male'; ")
for row in result:
    print("Results : ",row)
#Second filter condition:
result=engine.execute ("select * from Table_one where Sex=' Female' and BatchId like '%89392% '; ")
for row in result:
    print("Results : ",row)

Results :  (100, 76, ' Private', 124191, ' Masters', 14, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', 0, 0, 40, ' United-States', ' >50K')

In [39]:
#Que(5): Write two function queries??

In [40]:
results("select sum(Age) from Table_one  ;")

Results:  (1256076,)

In [44]:
results("select min(Age) from Table_one where Sex=' Male';")

Results:  (17,)